#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Plan 📖 `success`
#### Terraform Validation 🤖 `success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
module.resource_group.azurerm_resource_group.resource_group: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/indok-web-production]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1hZTkyMzIxOC03NzQ1LTQ2MmEtOGE4Zi05YzM2N2RmMDExNTk7b2JqZWN0SWQ9YjQ0OWExZjMtMzI4ZC00NTQ4LThhYjEtNmUxZGMwNDhlZGZmO3N1YnNjcmlwdGlvbklkPTBmNmI1YzhlLWNjMTUtNGFmNC1iYTYwLTQwYWE4MzAxOTU1ZTt0ZW5hbnRJZD1mMTdhY2Y1Ni1hYjEzLTQzZmEtYjlkNy1mMGUwZDYyODMyNmM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_role_assignment.service_principal will be created
  + resource "azurerm_role_assignment" "service_principal" {
      + description                      = "Manage all resources in the resource group indok-web-production, environment indok-web-production"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/indok-web-production"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.database.azurerm_postgresql_server.database will be created
  + resource "azurerm_postgresql_server" "database" {
      + administrator_login              = "postgres"
      + administrator_login_password     = (sensitive value)
      + auto_grow_enabled                = true
      + backup_retention_days            = (known after apply)
      + create_mode                      = "Default"
      + fqdn                             = (known after apply)
      + geo_redundant_backup_enabled     = false
      + id                               = (known after apply)
      + location                         = "norwayeast"
      + name                             = "indok-web"
      + public_network_access_enabled    = true
      + resource_group_name              = "indok-web-production"
      + sku_name                         = "B_Gen5_1"
      + ssl_enforcement_enabled          = true
      + ssl_minimal_tls_version_enforced = "TLS1_2"
      + storage_mb                       = 5120
      + tags                             = {
          + "environment" = "production"
          + "workspace"   = "production"
        }
      + version                          = "11"
    }

  # module.github.github_actions_environment_secret.azure_client_id will be created
  + resource "github_actions_environment_secret" "azure_client_id" {
      + created_at      = (known after apply)
      + environment     = "indok-web-production"
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless"
      + secret_name     = "AZURE_CLIENT_ID"
      + updated_at      = (known after apply)
    }

  # module.github.github_actions_environment_secret.azure_subscription_id will be created
  + resource "github_actions_environment_secret" "azure_subscription_id" {
      + created_at      = (known after apply)
      + environment     = "indok-web-production"
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless"
      + secret_name     = "AZURE_SUBSCRIPTION_ID"
      + updated_at      = (known after apply)
    }

  # module.github.github_actions_environment_secret.azure_tenant_id will be created
  + resource "github_actions_environment_secret" "azure_tenant_id" {
      + created_at      = (known after apply)
      + environment     = "indok-web-production"
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless"
      + secret_name     = "AZURE_TENANT_ID"
      + updated_at      = (known after apply)
    }

  # module.github.github_repository_environment.environment will be created
  + resource "github_repository_environment" "environment" {
      + environment = "indok-web-production"
      + id          = (known after apply)
      + repository  = "serverless"
    }

  # module.key_vault.data.azurerm_key_vault_secret.postgres_password will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "postgres_password" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "postgres-password"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # module.key_vault.azurerm_key_vault.key_vault will be created
  + resource "azurerm_key_vault" "key_vault" {
      + access_policy                 = [
          + {
              + application_id          = (known after apply)
              + certificate_permissions = []
              + key_permissions         = [
                  + "Get",
                  + "List",
                ]
              + object_id               = (known after apply)
              + secret_permissions      = [
                  + "Get",
                  + "List",
                ]
              + storage_permissions     = []
              + tenant_id               = (known after apply)
            },
          + {
              + application_id          = (known after apply)
              + certificate_permissions = []
              + key_permissions         = [
                  + "Backup",
                  + "Create",
                  + "Decrypt",
                  + "Delete",
                  + "Encrypt",
                  + "Get",
                  + "Import",
                  + "List",
                  + "Purge",
                  + "Recover",
                  + "Restore",
                  + "Sign",
                  + "UnwrapKey",
                  + "Update",
                  + "Verify",
                  + "WrapKey",
                  + "Release",
                  + "Rotate",
                  + "GetRotationPolicy",
                  + "SetRotationPolicy",
                ]
              + object_id               = "b449a1f3-328d-4548-8ab1-6e1dc048edff"
              + secret_permissions      = [
                  + "Backup",
                  + "Delete",
                  + "Get",
                  + "List",
                  + "Purge",
                  + "Recover",
                  + "Restore",
                  + "Set",
                  + "Backup",
                  + "Delete",
                  + "Get",
                  + "List",
                  + "Purge",
                  + "Recover",
                  + "Restore",
                  + "Set",
                ]
              + storage_permissions     = []
              + tenant_id               = "f17acf56-ab13-43fa-b9d7-f0e0d628326c"
            },
        ]
      + enabled_for_deployment        = true
      + enabled_for_disk_encryption   = true
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = "indok-web-production"
      + public_network_access_enabled = true
      + resource_group_name           = "indok-web-production"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tags                          = {
          + "environment" = "production"
          + "workspace"   = "production"
        }
      + tenant_id                     = (known after apply)
      + vault_uri                     = (known after apply)
    }

  # module.key_vault.azurerm_key_vault_secret.postgres_password will be created
  + resource "azurerm_key_vault_secret" "postgres_password" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "postgres-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.key_vault.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 128
      + lower       = true
      + min_lower   = 1
      + min_numeric = 1
      + min_special = 1
      + min_upper   = 1
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.key_vault.time_sleep.postgres_password will be created
  + resource "time_sleep" "postgres_password" {
      + create_duration = "10s"
      + id              = (known after apply)
    }

  # module.managed_identity.azurerm_user_assigned_identity.managed_identity will be created
  + resource "azurerm_user_assigned_identity" "managed_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "norwayeast"
      + name                = "indok-web-production"
      + principal_id        = (known after apply)
      + resource_group_name = "indok-web-production"
      + tags                = {
          + "environment" = "production"
          + "workspace"   = "production"
        }
      + tenant_id           = (known after apply)
    }

Plan: 11 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @larwaa, Action: `pull_request`*